## Data Frame

In [1]:
import pandas as pd

In [2]:
data ={
    "name":["Bill","Tom","Tim","John","Alex","Vanessa","Kate"],
    "score":[90,80,85,75,95,60,65],
    "sport":["wersling","football","skiing","swimming","tennis","kerate","surfing"],
    "gender":["M","M","M","F","M","M","M"]
}
df =pd.DataFrame(data)
df

      name  score     sport gender
0     Bill     90  wersling      M
1      Tom     80  football      M
2      Tim     85    skiing      M
3     John     75  swimming      F
4     Alex     95    tennis      M
5  Vanessa     60    kerate      M
6     Kate     65   surfing      M

In [4]:
interested_col =df[['name','score','sport']]
interested_col

      name  score     sport
0     Bill     90  wersling
1      Tom     80  football
2      Tim     85    skiing
3     John     75  swimming
4     Alex     95    tennis
5  Vanessa     60    kerate
6     Kate     65   surfing

In [51]:
df = pd.DataFrame(data,columns=["name","score","sport","gender"])
df

      name  score     sport gender
0     Bill     90  wersling      M
1      Tom     80  football      M
2      Tim     85    skiing      M
3     John     75  swimming      F
4     Alex     95    tennis      M
5  Vanessa     60    kerate      M
6     Kate     65   surfing      M

In [ ]:
# it shows top 5 
df.head()

   name  score     sport
0  Bill     90  wersling
1   Tom     80  football
2   Tim     85    skiing
3  John     75  swimming
4  Alex     95    tennis

In [ ]:
# it shows bottom 5 
df.tail()

      name  score     sport
2      Tim     85    skiing
3     John     75  swimming
4     Alex     95    tennis
5  Vanessa     60    kerate
6     Kate     65   surfing

In [ ]:
# it shows a sample  randomly
df.sample(n=3)

   name  score     sport
2   Tim     85    skiing
6  Kate     65   surfing
0  Bill     90  wersling

In [ ]:
# it describe a numerical column
df.describe()

           score
count   7.000000
mean   78.571429
std    12.817399
min    60.000000
25%    70.000000
50%    80.000000
75%    87.500000
max    95.000000

In [ ]:
# it shows all column
df.columns

Index(['name', 'score', 'sport'], dtype='object')

In [32]:
# accessing a single column
df['name']

0       Bill
1        Tom
2        Tim
3       John
4       Alex
5    Vanessa
6       Kate
Name: name, dtype: object

In [34]:
#accessing multiplying column
df[["name","sport","score"]]

      name     sport  score
0     Bill  wersling     90
1      Tom  football     80
2      Tim    skiing     85
3     John  swimming     75
4     Alex    tennis     95
5  Vanessa    kerate     60
6     Kate   surfing     65

In [35]:
## accessing a specific row by index
print(df.iloc[2])

name        Tim
score        85
sport    skiing
Name: 2, dtype: object

In [36]:
# accessing a range of rows using slicing

df.iloc[1:4,0:2]

   name  score
1   Tom     80
2   Tim     85
3  John     75

In [43]:
df.set_index("name",inplace=True)

In [40]:
df

         score     sport
name
Bill        90  wersling
Tom         80  football
Tim         85    skiing
John        75  swimming
Alex        95    tennis
Vanessa     60    kerate
Kate        65   surfing

In [41]:
df.reset_index(inplace=True)

In [44]:
df

         score     sport
name
Bill        90  wersling
Tom         80  football
Tim         85    skiing
John        75  swimming
Alex        95    tennis
Vanessa     60    kerate
Kate        65   surfing

In [46]:
#accessing row by label
df.loc["Bill"]

score          90
sport    wersling
Name: Bill, dtype: object

In [47]:
df.loc['Vanessa','sport']

'kerate'

In [48]:
#acceessing specific values using labels

df.loc["Bill","score"]

np.int64(90)

In [ ]:
# loc or iloc [row sclicing,column sclicing]

## Filtering data

In [52]:
df[df["gender"]=="M"]

      name  score     sport gender
0     Bill     90  wersling      M
1      Tom     80  football      M
2      Tim     85    skiing      M
4     Alex     95    tennis      M
5  Vanessa     60    kerate      M
6     Kate     65   surfing      M

In [56]:
# multipling filtering

df[df[(df["score"]>80) and (df["gender"]=="M")]]

ValueError: The truth value of a Series is ambiguous. Use a.empty, a.bool(), a.item(), a.any() or a.all().